# GetEnumerator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCollection..::..GetEnumerator Method
PointCollection Class See Also
---
Returns an enumerator that iterates through a collection.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IEnumerator<CloudPoint> GetEnumerator()
```

Visual Basic
---
```text
Public Overridable Function GetEnumerator As IEnumerator(Of CloudPoint)
```

Visual C++
---
```text
public:
virtual IEnumerator<CloudPoint>^ GetEnumerator()
```

# ### Return Value
An IEnumerator object that can be used to iterate through the collection.
# ### Implements
IEnumerable<(Of <(<'T>)>)>..::..GetEnumerator()()()()
# See Also
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace